In [1]:
import pandas as pd
import numpy as np
import sqlite3 

connection = sqlite3.connect('../data/vacancy.db')
cursor = connection.cursor()

def select(query):
    try:
        return pd.read_sql_query(query, connection)
    except:
        cursor.executescript(query)
        connection.commit()

In [5]:
query = r'''
    WITH RECURSIVE tmp(id, name, level) AS (
        SELECT id, name, 1 AS level
        FROM area
        WHERE parent_id IS NULL
    UNION ALL
    SELECT 
        area.id,
        tmp.name || ', ' || area.name AS name,
        tmp.level + 1 AS level
    FROM area
        JOIN tmp ON area.parent_id = tmp.id
    )
    SELECT *
    FROM tmp
    WHERE name LIKE '%Москва'
'''
select(query)

   id            name  level
0   1  Россия, Москва      2

### Рекурсивный обход метро

>Напишите рекурсивный запрос к таблице metro аналогично тому, как мы сделали для area на предыдущем шаге. Чему равно значение name для id = 48.265?

In [8]:
query = r'''
    WITH RECURSIVE metro_tmp(id, name, level) AS (
    SELECT id, name, 1 AS level
    FROM metro
    WHERE parent_id IS NULL
    
    UNION ALL
    
    SELECT 
        mt.id,
        metro_tmp.name || ', ' || mt.name AS name,
        metro_tmp.level + 1 AS level
    FROM metro mt
        JOIN metro_tmp ON metro_tmp.id = mt.parent_id
    )
    SELECT * 
    FROM metro_tmp
    WHERE id = '48.265'
'''
select(query)

       id                            name  level
0  48.265  Екатеринбург, Север-Юг, Динамо      3